Revit 2027 API
AssetPropertyDistance.Value Property
 Value of the property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Value { get; set; }
Public Property Value As Double
	Get
	Set
public:
property double Value {
	double get ();
	void set (double value);
}
member Value : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input value is invalid for this AssetPropertyDistance property.
InvalidOperationException |  When setting this property: The asset property is not editable.
See Also
Reference
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace